#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcp_resource.data.google_client_config.provider: Reading...
module.gcp_resource.data.google_container_cluster.my_cluster: Reading...
module.gcp_resource.data.google_client_config.provider: Read complete after 0s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.gcp_resource.data.google_container_cluster.my_cluster: Read complete after 4s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.gcp_resource.kubernetes_namespace.env: Refreshing state... [id=namespace-development]
module.gcp_resource.kubernetes_deployment.deployment: Refreshing state... [id=namespace-development/java-rest-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.gcp_resource.google_container_cluster.my_cluster will be created
  + resource "google_container_cluster" "my_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = false
      + enable_autopilot            = true
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "northamerica-northeast1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "java-rest-app"
      + network                     = "default"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + gateway_api_config (known after apply)

      + ip_allocation_policy (known after apply)

      + logging_config (known after apply)

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config (known after apply)
    }

  # module.gcp_resource.kubernetes_deployment.deployment will be updated in-place
  ~ resource "kubernetes_deployment" "deployment" {
        id               = "namespace-development/java-rest-app"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - name = "spring-boot-rest-app-1"
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - ephemeral-storage = "1Gi"
                                    }
                                  - name     = "spring-boot-rest-app-1"
                                  - requests = {
                                      - cpu               = "500m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "2Gi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
              - "autopilot.gke.io/warden-version"      = "31.23.0-gke.9" -> null
            }
            name             = "java-rest-app"
            # (6 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "spring-boot-rest-app-1"
                        # (10 unchanged attributes hidden)

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                  - security_context {
                      - run_as_non_root        = false -> null
                      - supplemental_groups    = [] -> null
                        # (4 unchanged attributes hidden)

                      - seccomp_profile {
                          - type              = "RuntimeDefault" -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - toleration {
                      - effect             = "NoSchedule" -> null
                      - key                = "kubernetes.io/arch" -> null
                      - operator           = "Equal" -> null
                      - value              = "amd64" -> null
                        # (1 unchanged attribute hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.gcp_resource.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "java_rest_app_hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "java-rest-app"
            }
          + name             = "java-rest-app-hpa-kfqf"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 3
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + behavior (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 80
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "java-rest-app"
            }
        }
    }

  # module.gcp_resource.kubernetes_service.my_service will be created
  + resource "kubernetes_service" "my_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "my-service"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "java-rest-app"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*